{
  "siteHeader": {
    "nav": {
      "links": {
        "about": "About",
        "experience": "Experience",
        "projects": "Projects",
        "contact": "Contact"
      }
    }
  },
  "aboutPage": {
    "pageHeaderTitle": "About",
    "aboutParagraphs": [
      "A curious full-stack developer who builds dynamic web experiences by day, and a strategic gamer & world cuisine explorer by night.",
      "For over 7 years, I've specialized in craftting engaging and performant front-end expereiences using modern tools like ReactJS and Vue. My passion lies in tinkering with code. Deconstructing complex problems and building elegant solutions from the ground up.",
      "While I'm front-end focused, I'm comfortable across the stack, working with Node.js, Python, and a variety of databases to bring projects to life.",
      "My love for strategy games isn't just a pastime. It's how I exercise my problem-solving muscles, thinking through architecture and user flow like a game of chess (Magic The Gathering).",
      "When I'm not coding, you'll find me in the kitchen, which I treat as my own personal lab. The process of following a recipe, of modifying an existing recipe, or creating one of my own, mirror my approach to development. Understanding the core components, experimenting with new flavors of libraries, and iterating until it's just right. This same curiosity drives me to constantly learn new technologies and explore how things work under the hood.",
      "Enjoyed learning about my approach? Check out my Projects page to see my work in action, or head over to my Contact page to discuss how we can build something amazing together."
    ]
  },
  "experiencePage": {
    "pageHeaderTitle": "Experience",
    "experiences": [
      {
        "companyName": "BelugaCDN",
        "jobTitle": "Frontend Developer",
        "timeWorked": "April 2016 - March 2018",
        "location": "Sunny Isles, FL. USA",
        "jobDescription": "Helped manage existing product site, and user interface, as well as adding new features. Used TDD, BDD, and Unit Testing to ensure code coverage. React.js, and Bootstrap were used to make for quicker, and more responsive sites. Created a Grafana Application Plugin for BelugaCDN clients to use."
      },
      {
        "companyName": "Newfold Digital (formally Endurance Group)",
        "jobTitle": "Software Engineer II",
        "timeWorked": "July 2018 - December 2023",
        "location": "Burlington, MA. USA",
        "jobDescription": "Was a part of the Innovation team. Worked on different frontend aspects pertaining to the Sitebuilder product. Helped incorporate ecommerce functionality into the company's Express Editor. Was a part of creating a new Social Booster ability in Sitebuilder. Which allows users to schedule posts and manage accounts linked to user’s Facebook, Twitter, and Google My Business."
      }
    ]
  },
  "projectsPage": {
    "pageHeaderTitle": "Projects",
    "item": {
      "description": "Description"
    },
    "iHaveNotions": {
      "title": "I_Have_Notions",
      "description": "An app written in Portuguese that explains the typology of the Enneagram personality types.",
      "stack": "A Vue v3.5.x, Vite v7.0.0, NodeJS v22.17, Express v5.1 SPA that has a database that is stored in the productivity app Notion.",
      "siteHref": "https://i-have-notions.netlify.app/",
      "githubUrls": ["https://github.com/ryanpaixao/I-have-notions"]
    },
    "localDeepseek": {
      "title": "Local_Deepseek",
      "description": "A Python repository that allows me to run different deekseek models on my local machine (NVIDIA GeForce RTX 3050, only 4GB of VRAM).",
      "siteHref": "",
      "stack": "Using Venv, Python v3.11.2, Cuda compilation tools@ v11.8.89, Nvidia driver v535.247.01 (supports up to CUDA v12.2)",
      "githubUrls": ["https://github.com/ryanpaixao/local_deepseek"]
    },
    "productivityDash": {
      "title": "Productivity_Dash",
      "description": "An app that tracks your tasks, habits, and moods. It can also visualize trends.",
      "stack": "The frontend uses React v19, chart.js v4.4.9, tanstack/react-query v5.76. The backend uses NodeJS v22.17, Express v5.1.0, and MongoDB v6.18",
      "siteHref": "https://wonderful-semifreddo-optimized.netlify.app/",
      "githubUrls": [
        "https://github.com/ryanpaixao/productivity-dashboard-frontend",
        "https://github.com/ryanpaixao/productivity-dashboard-backend"
      ]
    },
    "dashCap": {
      "title": "Dash_Cap",
      "description": "A financial dashboard to keep track of customers and invoices.",
      "stack": "A NextJS v15.3.2 app that uses typescript and tailwindcss v3.4.17.",
      "siteHref": "https://dash-cap.vercel.app",
      "githubUrls": ["https://github.com/ryanpaixao/dash-cap"]
    },
    "ryanpaixaoCom": {
      "title": "Ryanpaixao_Com",
      "description": "My professional website. (The site you're on right now.)",
      "stack": "A NextJS v15.5.4 app that uses typescript and tailwindcss v4.",
      "siteHref": "https://ryanpaixao.com",
      "githubUrls": ["https://github.com/ryanpaixao/ryanpaixao.com-src"]
    }
  },
  "contactPage": {
    "pageHeaderTitle": "Contact",
    "personalEmail": "contact@ryanpaixao.com",
    "personalGithub": "https://github.com/ryanpaixao",
    "personalLinkedIn": "https://www.linkedin.com/in/ryanpaixao/"
  }
}